--专精核心被动列表
local g_InnateCoreSkill = {
    --战士    
			[11]={
			--征伐 = 殊死一搏,不屈战魂
                [1]={11011044,11011104},
			--处刑 = 刽子手,不屈战魂
                [2]={11011054,11011104},
             },
    --法师   
			[12]={
			--寒冰 = 绝对零度,奥术师
                [1]={12011104,12028004},
			--火焰 = 火体爆破,奥术师
                [2]={12011064,12028004},
             },
    --牧师    
			[13]={
			--圣洁 = 恩惠,光晕
                [1]={13011014,13011294},
			--天罚 = 灵魂回响,光晕
                [2]={13011053,13011294},
             },
    --圣骑    
			[14]={
			--决斗 = 裁决者,神圣意志
                [1]={14001014,14003154},
			--冲锋 = 陷阵之志,神圣意志
                [2]={14002014,14003154},
             },
    --影舞    
			[18]={
			--追风 = 镰鼬,暗杀者
                [1]={18001014,18003144},
			--死士 = 魂魄·修罗,暗杀者
                [2]={18003014,18003144},
             },
	--游侠
			[19]={
			--射击 = 荷枪实弹
                [1]={19001004},
			--陷阱大师 = 
                [2]={},
             },
    }
GetInnateCoreSkill = function (vocation,innate)
    return g_InnateCoreSkill[tonumber(vocation)][tonumber(innate)]
end

--核心被动关联技能列表
local g_CoreSkillConnectSkill = {
	--【战士】殊死一搏 = 冲锋,毁灭刀刃,魔神打击,血战到底
	[11011044]={11001004,11002004,11005004,11008004},
	--【战士】刽子手 = 夺魂之链,处决
	[11011054]={10010894,11007004},
	--【法师】绝对零度 = 冰爽棱枪,寒冰箭,暴风雪
	[12011104]={12003004,12001004,12010534},
	--【法师】活体爆破 = 灼热,炎爆术,火焰喷射,火焰冲击
	[12011064]={12011054,12011074,12011084,12011164},
	--【牧师】恩惠 = 圣光术,苦行,圣光波纹
	[13011014]={13001004,13009004,13011244},
	--【牧师】灵魂回响 = 神圣震击,神罚,强效治疗术,神圣过载
	[13011053]={13002004,13011274,13011064,13011144},
	--【圣骑士】裁决者 = 荣耀战旗,圣光竞技场,正义之剑
	[14001014]={14001024,14001034,14001054},
	--【圣骑士】陷阵之志 = 陷阵冲锋,猎空之剑,荣耀决杀
	[14002014]={14002024,14002034,14002044},
	--【影武者】镰鼬 = 体术·追风,剑术·飓风
	[18001014]={18001024,18001044},
	--【影武者】魂魄·修罗 = 剑术·里鬼,剑术·灭杀,奥义·鬼人
	[18003014]={18001034,18003034,18003054},
	--【游侠】荷枪实弹 = 迅捷射击,致命狙击
	[19001004]={19003004,19004004},
}

GetCoreSkillConnectSkill = function(skill)
    return g_CoreSkillConnectSkill[tonumber(skill)]
end

--核心被动新手推荐技能(职业，专精，技能数量)
local g_CoreSkillRecommendSkill = {
    --战士推荐技能
    [1]={ 
        [1]={--专精
            [5]={--五技能推荐配置
	            --【战士征伐5技能第1套】 = 【核心被动】不屈战魂（通用）= 愤怒连击（核心）,毁灭刀刃（核心）,魔神打击（核心）,残废打击（辅助）,冲锋（辅助）
	            ["01010501"]={["coreskill"]=11011104,["commendlist"]={11000001,11002004,11005004,11003004,11001004}},
	        },
            [9]={--九技能推荐配置
                --【战士征伐10技能第1套】 = 【核心被动】殊死一搏 = 愤怒连击（核心）,毁灭刀刃（核心）,魔神打击（核心）,剑刃风暴（核心）,血战到底（核心）,冲锋（辅助）,天神下凡（辅助）,残废打击（辅助）,诸神徽记（辅助）
	            ["01010901"]={["coreskill"]=11011044,["commendlist"]={11000001,11002004,11005004,11009004,11008004,11001004,11010724,11003004,11011094}},
	            --【战士征伐10技能第2套】= 【核心被动】不屈战魂（通用）= 愤怒连击（核心）,毁灭刀刃（核心）,魔神打击（核心）,剑刃风暴（核心）,血战到底（核心）,冲锋（辅助）,破釜沉舟（辅助）,残废打击（辅助）,拳击（辅助）
	            ["01010902"]={["coreskill"]=11011104,["commendlist"]={11000001,11002004,11005004,11009004,11008004,11001004,11010674,11003004,11006004}},	
            },
        },
        [2]={
            [5]={--五技能推荐配置
	            --【战士处刑5技能第1套】 = 【核心被动】不屈战魂（通用）= 愤怒连击（核心）,夺魂之链（核心）,嗜血（核心）,残废打击（辅助）,英勇飞跃（辅助）
	            ["01020501"]={["coreskill"]=11011104,["commendlist"]={11000001,10010894,11011084,11003004,11010684}},
	        },
            [9]={--九技能推荐配置
                --【战士处刑10技能第1套】 =【核心被动】 刽子手 = 愤怒连击（核心）,夺魂之链（核心）,处决（核心）,嗜血（核心）,狂怒重剑（核心）,血之狂怒（辅助）,破釜沉舟（辅助）,残废打击（辅助）,碎尸万段（辅助）
	            ["01020901"]={["coreskill"]=11011054,["commendlist"]={11000001,10010894,11007004,11011084,11010734,11011074,11010674,11003004,11010243}},
	            --【战士处刑10技能第2套】= 【核心被动】刽子手 =愤怒连击（核心）,夺魂之链（核心）,处决（核心）,嗜血（核心）,风暴之锤（核心）,英勇飞跃（辅助）,镇压（辅助）,拳击（辅助）,碎尸万段（辅助）
	            ["01020902"]={["coreskill"]=11011054,["commendlist"]={11000001,10010894,11007004,11011084,11010714,11010684,11004004,11006004,11010243}}, 
            },
	    }
    },
	
	--法师推荐技能
    [2]={
        [1]={--专精
            [5]={--五技能推荐配置
	                --【法师冰霜5技能第1套】 = 奥术师（通用）= 寒冰箭(核心),冰霜凌枪(核心),冰霜结界(核心),奥术跃迁（辅助）,寒冰魔环（辅助）
	                ["02010501"]={["coreskill"]=12028004,["commendlist"]={12001004,12003004,12007004,12010004,12002004}},
             },
            [9]={--九技能推荐配置
	            --【法师冰霜10技能第1套】= 绝对零度 = 寒冰箭(核心),冰霜凌枪(核心),暴风雪(核心),寒冰牢笼(核心),冰霜结界（核心）,变形术（辅助）,奥术跃迁（辅助）,寒冰魔环（辅助）,极效冷却（辅助）
	            ["02010901"]={["coreskill"]=12011104,["commendlist"]={12001004,12003004,12010534,12004004,12007004,12008003,12010004,12002004,12006004}},
	            --【法师冰霜10技能第2套】= 绝对零度 = 寒冰箭(核心)	冰霜凌枪(核心),暴风雪(核心),冰锥术（核心）,冰霜结界（核心）,变形术（辅助）,奥术跃迁（辅助）,禁魔术（辅助）,时空断层（辅助）
	            ["02010902"]={["coreskill"]=12011104,["commendlist"]={12001004,12003004,12010534,12011114,12007004,12008003,12010004,12009003,10010904}},
             },
        },
        [2]={
            [5]={--五技能推荐配置
	            --【法师火焰5技能第1套】 = 奥术师（通用）=灼热（核心）,火焰喷射（核心）,熔岩护盾（核心）,奥术跃迁（辅助）,元素专注（辅助）
	            ["02020501"]={["coreskill"]=12028004,["commendlist"]={12011054,12011084,12011174,12010004,12011184}},
            },
	        [9]={--九技能推荐配置
                --【法师火焰10技能第1套】= 活体爆破 = 灼热（核心）,炎爆术（核心）,火焰喷射（核心）,火焰冲击（核心）,熔岩护盾（核心）,变形术（辅助）,奥术跃迁（辅助）,禁魔术（辅助）,时空断层（辅助）
	            ["02020901"]={["coreskill"]=12011064,["commendlist"]={12011054,12011074,12011084,12011164,12011174,12008003,12010004,12009003,10010904}},
	            --【法师火焰10技能第2套】= 活体爆破 = 灼热（核心）,炎爆术（核心）,火焰喷射（核心）,火焰冲击（核心）,熔岩护盾（核心）,变形术（辅助）,奥术跃迁（辅助）,炙灼（辅助）,时空断层（辅助）
	            ["02020902"]={["coreskill"]=12011064,["commendlist"]={12011054,12011074,12011084,12011164,12011174,12008003,12010004,12110574,10010904}},
            },
	    },
	},
    --牧师推荐技能
    [3]={ 
        [1]={--专精
            [5]={--五技能推荐配置
	             --【牧师圣洁5技能第1套】 = 救赎天使（通用）= 圣光术（核心）,苦行（核心）,信仰之盾（核心）,盲目之光（辅助）,神圣领域（辅助）
	             ["03010501"]={["coreskill"]=13011294,["commendlist"]={13001004,13009004,13004004,13011164,13007001}},
            },
            [9]={--九技能推荐配置
	            --【牧师圣洁10技能第1套】= 恩惠 = 圣光术（核心）,苦行（核心）,信仰之盾（核心）,圣灵守护（核心）,圣使之地（核心）,盲目之光（辅助）,净化术（辅助）,光明信标（辅助）,神圣领域（辅助）
	            ["03010901"]={["coreskill"]=13011014,["commendlist"]={13001004,13009004,13004004,13008004,13011104,13011164,13006002,13011224,13007001}},
	            --【牧师圣洁10技能第2套】= 恩惠 = 圣光术（核心）,苦行（核心）,信仰之盾（核心）,圣灵守护（核心）,绝望祷言（核心）,盲目之光（辅助）,净化术（辅助）,天光之翼（辅助）,神圣领域（辅助）
	            ["03010902"]={["coreskill"]=13011014,["commendlist"]={13001004,13009004,13004004,13008004,13011234,13011164,13006002,13010004,13007001}},
            },
        },
        [2]={
            [5]={--五技能推荐配置
	            --【牧师天罚5技能第1套】 = 救赎天使（通用）= 神圣震击（核心）,神罚（核心）,强效治疗术（核心）,净化术（辅助）,盲目之光（辅助）
	            ["03020501"]={["coreskill"]=13011294,["commendlist"]={13002004,13011274,13011064,13006002,13011164}},
            },
	        [9]={--九技能推荐配置
                --【牧师天罚10技能第1套】= 灵魂回响 = 神圣震击（核心）,神罚（核心）,强效治疗术（核心）,圣灵守护（核心）,光明使者（核心）,盲目之光（辅助）,净化术（辅助）,神圣过载（辅助）,神圣领域（辅助）
	            ["03020901"]={["coreskill"]=13011053,["commendlist"]={13002004,13011274,13011064,13008004,13011264,13011164,13006002,13011144,13007001}},
	            --【牧师天罚10技能第2套】= 灵魂回响 = 神罚（核心）,神圣余辉（核心）,强效治疗术（核心）,圣灵守护（核心）,庇护之光（核心）,灵光一现（辅助）,净化术（辅助）,天光之翼（辅助）,神圣领域（辅助）
	            ["03020902"]={["coreskill"]=13011053,["commendlist"]={13011274,13003004,13011064,13008004,13011084,13011254,13006002,13010004,13007001}},
            },
	    },
	},
	--圣骑士推荐技能
	[4]={ 
        [1]={--专精
            [5]={--五技能推荐配置
	             --【圣骑士决斗5技能第1套】 = 神圣意志（通用）= 圣锤连击（核心）,圣光竞技场（核心）,荣耀战旗（核心）,忏悔之锤（辅助）,骑士王的荣耀（辅助）
	            ["04010501"]={["coreskill"]=14003154,["commendlist"]={14000001,14001034,14001024,14002074,14002084}},
            },
            [9]={--九技能推荐配置
	            --【圣骑士决斗10技能第1套】= 裁决者 = 圣锤连击（核心）,正义之剑（核心）,圣光竞技场（核心）,荣耀战旗（核心）,公正裁决（核心）,责难（辅助）,骑士王的荣耀（辅助）,忏悔之锤（辅助）,圣盾术（辅助）
	            ["04010901"]={["coreskill"]=14001014,["commendlist"]={14000001,14001054,14001034,14001024,14001044,14001064,14002084,14002074,14003064}},
	            --【圣骑士决斗10技能第2套】= 神圣意志（通用）= 圣锤连击（核心）,正义之剑（核心）,公正裁决（核心）,光明审判（核心）,神圣猎杀（核心）,怜悯（辅助）,骑士王的荣耀（辅助）,牺牲圣印（辅助）,神使庇护（辅助）
	            ["04010902"]={["coreskill"]=14003154,["commendlist"]={14000001,14001054,14001044,14002054,14003124,14003104,14002084,14003134,14003074}},
            },
        },
        [2]={
            [5]={--五技能推荐配置
	            --【圣骑士冲锋5技能第1套】 = 神圣意志（通用）= 圣锤连击（核心）,猎空之剑（核心）,陷阵冲锋（核心）,忏悔之锤（辅助）,骑士荣王的耀（辅助）
	            ["04020501"]={["coreskill"]=14003154,["commendlist"]={14000001,14002034,14002024,14002074,14002084}},
            },
	        [9]={--九技能推荐配置
                --【圣骑士冲锋10技能第1套】= 陷阵之志 = 圣锤连击（核心）,猎空之剑（核心）,陷阵冲锋（核心）,荣耀决杀（核心）,光明审判（核心）,自由骑士（辅助）,诸神守护（辅助）,忏悔之锤（辅助）,正义追击（通用）
	            ["04020901"]={["coreskill"]=14002014,["commendlist"]={14000001,14002034,14002024,14002044,14003124,14002074,14002084,14001074,14002064}},
	            --【圣骑士冲锋10技能第2套】= 陷阵之志 = 圣锤连击（核心）,猎空之剑（核心）,陷阵冲锋（核心）,荣耀决杀（核心）,神圣猎杀（核心）,怜悯（辅助）,骑士王的荣耀（辅助）,忏悔之锤（辅助）,责难（辅助）
	            ["04020902"]={["coreskill"]=14002014,["commendlist"]={14000001,14002034,14002024,14002044,14003124,14003104,14002084,14002074,14001064}},
				
            },
	    },
	},
    --影武者推荐技能
	[8]={ 
        [1]={--专精
            [5]={--五技能推荐配置
	             --【影武者追风5技能第1套】 = 暗杀者（通用）= 普攻,剑术·里鬼,剑术·飓风,体术·追风,影术·替身,暗影遮罩
	            ["08010501"]={["coreskill"]=18003144,["commendlist"]={18000001,18001034,18001044,18001024,18001064,18002084}},
            },
            [9]={--九技能推荐配置
	            --【影武者追风10技能第1套】= 镰鼬 = 普攻,剑术·里鬼,剑术·飓风,体术·追风,忍术·影缚,毒术·红鹤,极限闪避,毒术·青叶,暗影遮罩
	            ["08010901"]={["coreskill"]=18001014,["commendlist"]={18000001,18001034,18001044,18001024,18002054,18001104,18001084,18001094,18002084}},
	            --【影武者追风10技能第2套】= 镰鼬 = 普攻,剑术·白打,剑术·飓风,体术·追风,忍术·影缚,刀剑护盾,极限闪避,影术·替身,暗影遮罩
	            ["08010902"]={["coreskill"]=18001014,["commendlist"]={18000001,18003024,18001044,18001024,18002054,18003074,18001084,18001064,18002084}},
            },
        },
        [2]={
            [5]={--五技能推荐配置
	            --【影武者死士5技能第1套】 = 暗杀者（通用）= 普攻,剑术·里鬼,剑术·灭杀,奥义·鬼人,毒镖,暗影遮罩
	            ["08020501"]={["coreskill"]=18003144,["commendlist"]={18000001,18001034,18003034,18003054,18003084,18002084}},
            },
	        [9]={--九技能推荐配置
                --【影武者死士10技能第1套】= 魂魄·修罗 = 普攻,剑术·白打,剑术·灭杀,奥义·鬼人,忍术·影缚,强心剂,暗影遮罩,疾风步,魂葬
	            ["08020901"]={["coreskill"]=18003014,["commendlist"]={18000001,18003024,18003034,18003054,18002054,18003064,18002084,18001074,18003104}},
	            --【影武者死士10技能第2套】= 暗杀者（通用）= 普攻,剑术·里鬼,剑术·灭杀,奥义·鬼人,幻术·凶铃,毒镖,暗影遮罩,疾风步,消散
	            ["08020902"]={["coreskill"]=18003144,["commendlist"]={18000001,18001034,18003034,18003054,18003044,18003084,18002084,18001074,18002064}},
            },
	    },
	},
    --游侠推荐技能
	[9]={ 
        [1]={--射击专精
            [5]={--五技能推荐配置
	             --【游侠射击5技能第1套】 = 荷枪实弹 = 连弩,迅捷射击,致命狙击,战术翻滚,静默之箭
	            ["09010501"]={["coreskill"]=19001004,["commendlist"]={19000001,19003004,19004004,19006004,19007004}},
            },
            [9]={--九技能推荐配置
	            --【游侠射击10技能第1套】= 荷枪实弹 = 连弩,迅捷射击,致命狙击,弹药装填,黑箭,战术翻滚,静默之箭,急速之击,风行者
	            ["09010901"]={["coreskill"]=19001004,["commendlist"]={19000001,19003004,19004004,19002004,19005004,19006004,19007004,19008004,19009004}},
	            --【游侠射击10技能第2套】= 荷枪实弹 = 连弩,迅捷射击,致命狙击,弹药装填,黑箭,战术翻滚,静默之箭,急速之击,充能箭矢
	            ["09010902"]={["coreskill"]=19001004,["commendlist"]={19000001,19003004,19004004,19002004,19005004,19006004,19007004,19008004,19010004}},
            },
        },
        [2]={

        },
	},
}

GetCoreSkillRecommendSkill = function(vocation,innate,skillnum)
    return g_CoreSkillRecommendSkill[tonumber(vocation)][tonumber(innate)][tonumber(skillnum)]
end

--核心技能光效表现
local g_CoreSkillEffect = {
    --【战士】殊死一搏
	[11011044]={
       [0] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_zhengfazhanshi.tme"},
       [1] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_zhengfazhanshi_start.tme"},
    },
	--【战士】刽子手
	[11011054]={
        [0] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_shouren.tme"},
        [1] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_shouren_start.tme"},
    },
    --【战士】不屈战魂
	[11011104]={
        [0] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_zhanshi_common.tme"},
        [1] = {
                ["tme"]="effect/ui/ui_skill_beidong/tps_ui_zhanshi_common_blood.tme",
                ["speed"]=4,
        },
        [2] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_zhanshi_common_start.tme"},
    },
	--【法师】奥术师
    [12028004]={
        [0] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_aoshufashi.tme"},
        [1] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_aoshufashi_start1.tme"},
        [2] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_aoshufashi_start2.tme"},
        [3] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_aoshufashi_end.tme"},
        [4] = {
                ["tme"]="effect/ui/ui_skill_beidong/tps_ui_aoshufashi_energybar.tme",
                ["speed"]=2.4,
        }

    },
    --绝对零度
	[12011104]={
        [0] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_bingfa.tme"},
        [1] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_bingfa_start1.tme"},
        [2] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_bingfa_start2.tme"},
        [3] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_bingfa_start3.tme"},
        [4] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_bingfa_start4.tme"},
        [5] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_bingfa_end.tme"},
    },
	--【法师】活体爆破
	[12011064]={
        [0] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_huofa.tme"},
        [1] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_huofa_start1.tme"},
        [2] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_huofa_start2.tme"},
        [3] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_huofa_end.tme"},
    },
    --【牧师】光晕
	[13011294]={
        [0] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_mushi_common.tme"},
        [1] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_mushi_common_start.tme"},
    },
	--【牧师】恩惠
	[13011014]={
        [0] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_mushi.tme"},
        [1] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_mushi_start_01.tme"},
        [2] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_mushi_start_02.tme"},
        [3] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_mushi_start_03.tme"},
        [4] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_mushi_start_04.tme"},
        [5] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_mushi_start_05.tme"},
        [6] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_mushi_end.tme"},
    },
	--【牧师】灵魂回响
	[13011053]={
        [0] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_tianfamushi.tme"},
        [1] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_tianfamushi_start1.tme"},
        [2] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_tianfamushi_start2.tme"},
        [3] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_tianfamushi_end.tme"},
    },
    --【圣骑士】神圣意志
	[14003154]={
        [0] ={["tme"]="effect/ui/ui_skill_beidong/tps_ui_qishi_common.tme"},
        [1] ={
             ["tme"]="effect/ui/ui_skill_beidong/tps_ui_qishi_common_1.tme",
             ["state"]=3,
        },
        [2] ={
            ["tme"]="effect/ui/ui_skill_beidong/tps_ui_qishi_common_attack.tme",
            ["state"]=2,
        },
        [3] ={
            ["tme"]="effect/ui/ui_skill_beidong/tps_ui_qishi_common_defense.tme",
            ["state"]=1,
        },
    },      
	--【圣骑士】裁决者
	[14001014]={
        [0] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_juedouqi.tme"},
        [1] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_juedouqi_start.tme"},
    },
	--【圣骑士】陷阵之志
	[14002014]={
        [0] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_qishi.tme"},
        [1] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_qishi_start_01.tme"},
        [2] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_qishi_start_02.tme"},
        [3] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_qishi_start_03.tme"},
        [4] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_qishi_start_04.tme"},
        [5] = {["tme"]="effect/ui/ui_skill_beidong/tps_ui_qishi_end.tme"},
    },
	--【影武者】镰鼬
	[18001014]={},
	--【影武者】魂魄·修罗
	[18003014]={},
    --【游侠】荷枪实弹
	[19001004]={},
}

GetCoreSkillEffect = function(skill)
    return g_CoreSkillEffect[tonumber(skill)]
end
